type("sdsa")             # возвращает тип переменной

list1 = ["s", "w", "e"]
str1 = "sdas asdasd asdas"

str1.split(" ")                     # делает из строки массив по разделителю

" ".join(list1)                     # делает из массива строку по разделителю

str2 = "Привет, World!"

str2.replace("World", "Мир")        # Меняет в строке подстроку на нужную

globals()                           # глобальный массив который содержит
                                    # все классы и объекты программы




